// pages/yufang/yufang.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    wordList: [{
        "title": "1、警惕陌生电话和短信",
        "text": "很多人都会接到陌生电话或短信，告诉你中了大奖或者需要支付一些费用才能领取奖励。这种情况下，我们要保持警惕，不要轻易相信对方所说的话。如果对方让你提供个人信息或者转账，更要立刻挂断电话或删除短信。"
      },
      {
        "title": "2、不轻易相信网上信息",
        "text": "在互联网上，有很多虚假信息和广告，很容易让人，上当受骗。因此，在网上购物、交友、投资等方面时，我们应该谨慎选择可靠的网站和平台，并且不轻易相信来自陌生人的信息。"
      },
      {
        "title": "3、保护个人隐私",
        "text": "个人隐私泄露是导致网络诈骗的主要原因之一。因此，我们要注意保护自己的个人信息，不要随意透露身份证号码、银行卡号、手机号码、验证码等敏感信息。"
      },
      {
        "title": "4、学会辨别诈骗手段",
        "text": "网络诈骗手段层出不穷，常见的有假冒网站、虚假中奖、虚假招聘、虚假客服等。我们需要学会辨别这些诈骗手段，并及时向相关部门报告。"
      },
      {
        "title": "5、增强防范意识",
        "text": "预防胜于治疗。在面对网络诈骗时，我们需要增强自己的防范意识，不轻信陌生人的话，不随意打开陌生邮件或链接，及时更新杀毒软件和操作系统等措施。"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})